docs/leets/0394-Decode-String.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-07-24 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>0394. Decode String</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 2024-05-24
</div>
<div id="content" class="content">
<header>
<h1 class="title">0394. Decode String</h1>
<p class="subtitle" role="doc-subtitle">leetcode</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2f9e4ce">Problem Overview</a></li>
<li><a href="#org5503bdc">Solution Outline</a>
<ul>
<li><a href="#org3dbe7a1">Preferred Structure</a></li>
<li><a href="#orgb52d1e2">Brute Force vs Optimal Solution</a></li>
<li><a href="#org0e13dcd">Algorithm Choice</a></li>
</ul>
</li>
<li><a href="#org28046f7">Solution Implementation</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org2f9e4ce" class="outline-2">
<h2 id="org2f9e4ce">Problem Overview</h2>
<div class="outline-text-2" id="text-org2f9e4ce">
<p>
The problem involves decoding a given encoded string that follows a specific format: numbers followed by square brackets containing a substring. The numbers indicate how many times the substring within the brackets should be repeated. The string can be nested with multiple levels of encoding.
</p>

<p>
Example:
</p>
<ul class="org-ul">
<li>Input: "3[a]2[bc]"</li>
<li>Output: "aaabcbc"</li>
</ul>
</div>
</div>

<div id="outline-container-org5503bdc" class="outline-2">
<h2 id="org5503bdc">Solution Outline</h2>
<div class="outline-text-2" id="text-org5503bdc">
</div>
<div id="outline-container-org3dbe7a1" class="outline-3">
<h3 id="org3dbe7a1">Preferred Structure</h3>
<div class="outline-text-3" id="text-org3dbe7a1">
<ul class="org-ul">
<li>Use a stack to help with decoding, as it can handle nested patterns effectively.</li>
<li>Utilize string operations to build the decoded result.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb52d1e2" class="outline-3">
<h3 id="orgb52d1e2">Brute Force vs Optimal Solution</h3>
<div class="outline-text-3" id="text-orgb52d1e2">
<ul class="org-ul">
<li><b><b>Brute Force Approach:</b></b> Recursively decode the string, which might be inefficient for deeply nested patterns due to call stack limitations.</li>
<li><b><b>Optimal Solution:</b></b> Use an iterative approach with a stack to manage nested structures and avoid recursion depth issues.</li>
</ul>
</div>
</div>

<div id="outline-container-org0e13dcd" class="outline-3">
<h3 id="org0e13dcd">Algorithm Choice</h3>
<div class="outline-text-3" id="text-org0e13dcd">
<ul class="org-ul">
<li><b><b>Stack-based Decoding:</b></b> This method iterates through the string, pushing numbers and current substrings onto the stack whenever a new bracket is encountered. When a closing bracket is found, it constructs the substring by popping from the stack, which ensures correct handling of nested patterns.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org28046f7" class="outline-2">
<h2 id="org28046f7">Solution Implementation</h2>
<div class="outline-text-2" id="text-org28046f7">
<p>
Here's the skeleton of the solution with test cases. The core implementation will follow in incremental steps.
</p>

<div class="org-src-container">
<pre class="src src-js">/**
 * Decode the given encoded string.
 * @param {string} s - The encoded string.
 * @returns {string} - The decoded string.
 */
function decodeString(s) {
    // Initial implementation, returns empty string for now
    let r = '';
    let numbers = '';
    let letters = '';

    const stack = [];

    for (let ch of s) {
        const isDigit = /[0-9]/.test(ch);
        const isLetter = /[a-zA-Z]/.test(ch);
        const isStartGroup = ch === '[';
        const isEndGroup = ch === ']';
        const wtf = !isDigit &amp;&amp; !isLetter &amp;&amp; !isStartGroup &amp;&amp; !isEndGroup;

                  console.log(`ch = '${ch}; isDigit = ${isDigit}'; isLetter = ${isLetter}; isStartgroup = ${isStartGroup}; isEndgroup = ${isEndGroup}; stack=${stack}; letters='${letters}'`);

        if (wtf) {
            throw "Bleah!";
        }

        if (isDigit) {
            numbers += ch;
        } else if (isLetter) {
            letters += ch;
        } else if (isStartGroup) {
            stack.push({numbers, letters});
            numbers = '';
            letters = '';
        } else if (isEndGroup) {

            let oldL = '';
            let oldN = '';

            if (stack.length) {
                const x = stack.pop();
                oldL = x.letters;
                oldN = x.numbers;
            }

            letters = oldL + letters.repeat(oldN);

        }


    }

    return letters;
}

// Test cases
const testCases = [
    { input: "3[a]2[bc]", expected: "aaabcbc" },
    { input: "3[a2[c]]", expected: "accaccacc" },
    { input: "2[abc]3[cd]ef", expected: "abcabccdcdcdef" },
    { input: "abc3[cd]xyz", expected: "abccdcdcdxyz" },
];

testCases.forEach((test, index) =&gt; {
    const result = decodeString(test.input);
    console.log(`Test Case ${index + 1}: ${result === test.expected ? 'Passed' : 'Failed'} (Expected: ${test.expected}, Got: ${result})`);
});
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. <a href="/sitemap.html">sitemap</a>
</div>
</body>
</html>
